; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v1)
		(pred_4 ?v3)
		(pred_2 ?v2)
		(pred_6 ?v2)
		(pred_1 ?v3 ?v2)
		(pred_3)
		(pred_5 ?v3))

   (:action op_3
       :parameters  (?v7 ?v4)
       :precondition (and (not-eq ?v7 ?v4) 
                          (pred_2 ?v7) (pred_2 ?v4) (pred_6 ?v7))
       :effect (and  (pred_6 ?v4)
		     (not (pred_6 ?v7))))


   (:action op_2
       :parameters (?v8 ?v5)
       :precondition  (and  (pred_4 ?v8) (pred_2 ?v5)
			    (pred_1 ?v8 ?v5) (pred_6 ?v5) (pred_3))
       :effect (and (pred_5 ?v8)
		    (not (pred_1 ?v8 ?v5)) 
		    (not (pred_3))))

   (:action op_1
       :parameters  (?v8  ?v5)
       :precondition  (and  (pred_4 ?v8) (pred_2 ?v5)
			    (pred_5 ?v8) (pred_6 ?v5))
       :effect (and (pred_1 ?v8 ?v5)
		    (pred_3)
		    (not (pred_5 ?v8)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_04 obj_02 obj_06 obj_09 obj_05 obj_03 
          obj_01 obj_07 obj_08 
)
(:init
(pred_2 obj_04)
(pred_2 obj_02)
(pred_2 obj_06)
(pred_2 obj_09)
(pred_2 obj_05)
(pred_2 obj_03)
(pred_4 obj_01)
(pred_4 obj_07)
(pred_4 obj_08)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_09)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_06 obj_09)
(not-eq obj_09 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_09 obj_05)
(not-eq obj_05 obj_09)
(not-eq obj_09 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(pred_3)
(pred_1 obj_01 obj_05)
(pred_1 obj_07 obj_03)
(pred_1 obj_08 obj_05)
(pred_6 obj_04)
)
(:goal
(and
(pred_1 obj_01 obj_04)
(pred_1 obj_07 obj_03)
(pred_1 obj_08 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_01 obj_04) (pred_6 obj_02))
    (sometime-before  (pred_1 obj_08 obj_02) (pred_6 obj_06))
  )
)
)

; plan
1. (op_3 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_05)
   goals met: 1 of 3
2. (op_2 obj_08 obj_05)
   deleted: (pred_1 obj_08 obj_05) (pred_3)
   added: (pred_5 obj_08)
   goals met: 1 of 3
3. (op_3 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_04)
   goals met: 1 of 3
4. (op_1 obj_08 obj_04)
   deleted: (pred_5 obj_08)
   added: (pred_1 obj_08 obj_04) (pred_3)
   goals met: 1 of 3
5. (op_3 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_05)
   goals met: 1 of 3
6. (op_2 obj_01 obj_05)
   deleted: (pred_1 obj_01 obj_05) (pred_3)
   added: (pred_5 obj_01)
   goals met: 1 of 3
7. (op_3 obj_05 obj_06)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_06)
   goals met: 1 of 3
8. (op_1 obj_01 obj_06)
   deleted: (pred_5 obj_01)
   added: (pred_1 obj_01 obj_06) (pred_3)
   goals met: 1 of 3
9. (op_3 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_04)
   goals met: 1 of 3
10. (op_2 obj_08 obj_04)
   deleted: (pred_1 obj_08 obj_04) (pred_3)
   added: (pred_5 obj_08)
   goals met: 1 of 3
11. (op_3 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_02)
   goals met: 1 of 3
12. (op_1 obj_08 obj_02)
   deleted: (pred_5 obj_08)
   added: (pred_1 obj_08 obj_02) (pred_3)
   goals met: 2 of 3
13. (op_3 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_06)
   goals met: 2 of 3
14. (op_2 obj_01 obj_06)
   deleted: (pred_1 obj_01 obj_06) (pred_3)
   added: (pred_5 obj_01)
   goals met: 2 of 3
15. (op_3 obj_06 obj_04)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_04)
   goals met: 2 of 3
16. (op_1 obj_01 obj_04)
   deleted: (pred_5 obj_01)
   added: (pred_1 obj_01 obj_04) (pred_3)
   goals met: 3 of 3
